---
type: SlabShapeCreaseArray
namespace: Autodesk.Revit.DB
version: 2024
members: 10
tags: [revit-api, class]
---

# SlabShapeCreaseArray

`Autodesk.Revit.DB.SlabShapeCreaseArray` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | SlabShapeCreaseArray | — | `public SlabShapeCreaseArray ()` |
| Method | Append | — | `public virtual void Append ( SlabShapeCrease item )` |
| Method | Clear | — | `public virtual void Clear ()` |
| Method | ForwardIterator | — | `public virtual SlabShapeCreaseArrayIterator ForwardIterator ()` |
| Method | GetEnumerator | — | `public virtual IEnumerator GetEnumerator ()` |
| Method | Insert | — | `public virtual void Insert ( SlabShapeCrease item , int index )` |
| Method | ReverseIterator | — | `public virtual SlabShapeCreaseArrayIterator ReverseIterator ()` |
| Property | IsEmpty | — | `public virtual bool IsEmpty { get ; }` |
| Property | Item | — | `public virtual SlabShapeCrease this [ int index ] { get ; set ; }` |
| Property | Size | — | `public virtual int Size { get ; }` |